; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2861)
	(= (fuel plane1) 434)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city1)
	(= (capacity plane2) 9274)
	(= (fuel plane2) 1442)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city2)
	(= (capacity plane3) 5457)
	(= (fuel plane3) 482)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 8)
	(at plane4 city1)
	(= (capacity plane4) 9879)
	(= (fuel plane4) 3205)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 9)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at plane5 city1)
	(= (capacity plane5) 6588)
	(= (fuel plane5) 2529)
	(= (slow-burn plane5) 3)
	(= (fast-burn plane5) 11)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 4)
	(at person1 city2)
	(at person2 city1)
	(at person3 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 745)
	(= (distance city0 city2) 718)
	(= (distance city1 city0) 745)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 955)
	(= (distance city2 city0) 718)
	(= (distance city2 city1) 955)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane5 city0)
	(at person1 city1)
	(at person2 city0)
	(at person3 city2)
	))

(:metric minimize (+ (* 1 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (board person1 plane3 city2)
   deleted: (at person1 city2)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 4
2. (board person2 plane5 city1)
   deleted: (at person2 city1)
   added: (in person2 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 0 of 4
3. (fly plane4 city1 city0)
   deleted: (at plane4 city1)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 0 to 2980, (fuel plane4) from 3205 to 225
   goals met: 0 of 4
4. (refuel plane3 city2)
   changed: (fuel plane3) from 482 to 5457
   goals met: 0 of 4
5. (fly plane5 city1 city0)
   deleted: (at plane5 city1)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 2980 to 5215, (fuel plane5) from 2529 to 294
   goals met: 1 of 4
6. (debark person2 plane5 city0)
   deleted: (in person2 plane5)
   added: (at person2 city0)
   changed: (onboard plane5) from 1 to 0
   goals met: 2 of 4
7. (fly plane3 city2 city1)
   deleted: (at plane3 city2)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 5215 to 7125, (fuel plane3) from 5457 to 3547
   goals met: 2 of 4
8. (debark person1 plane3 city1)
   deleted: (in person1 plane3)
   added: (at person1 city1)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 4
9. (refuel plane4 city0)
   changed: (fuel plane4) from 225 to 9879
   goals met: 3 of 4
10. (board person3 plane4 city0)
   deleted: (at person3 city0)
   added: (in person3 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 3 of 4
11. (fly plane4 city0 city2)
   deleted: (at plane4 city0)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 7125 to 9997, (fuel plane4) from 9879 to 7007
   goals met: 3 of 4
12. (debark person3 plane4 city2)
   deleted: (in person3 plane4)
   added: (at person3 city2)
   changed: (onboard plane4) from 1 to 0
   goals met: 4 of 4
